2019-09-16 ~ 2019-09-24
*  Data Base
 - DataBase 개념 및 내용 / 기초지식 습득
 - 데이터베이스 시스템 개요와 발전과정
 - ANSI/SPARC 아키텍처와 데이터 독립성
 - 관계 데이터 모델과 그 제약조건
 - 모델의 개념과 무결성 제약조건에 대해 탐구
 - 렐리이션의 특성과 키 탐구

2019-09-30
*  Data Base
 - Linux 환경 설정
  : 환경 설정 실패 -> Window 환경 설정으로 변경

 - Oracle 서버 구축
  : Oracle 서버 이용이 어려워 Mysql로 대체 

 - Mysql 기본 문법 및 명령어 숙지
   : 인프런 "생활코딩 Mysql" 강좌 참고

2019-10-02
* DB Mysql 응용명령어 탐구
* DB Mysql 설계와 ER 모델 연구


2019-10-07
* 보안모듈을 이용한 Database 프로그램 프로젝트 기획
 - JSP와 mySql 연동 및 환경 설정
 - tomcat server와 JSP 연동 
 - 기본 Query 호출과 네트워크 연결
 - 기본 Code 예제 실습

2019-10-08
 - Server와 Client 연결
 - Server에 있는 Record 값 추가 및 변경문 작성
 - jsp 기본 문법 실습및 탐구

2019-10-10
 - Server에 새로운 Table 추가
 - 이미지 파일과 저장 경로를 Database Server에 저장하는 코드 연구
 - Database 로그인 기능 버그 수정

2019-10-11
 - 이미지 파일과 저장 경로를 Database Server에 저장
 - 로그인 기능 보안 강화
 - 페이지 UI 디자인 실시

2019-10-14
* KISA 제공 암, 복호화 오픈소스 연구
 - 각 암, 복호화 알고리즘 연구 및 탐구
 - 이미지 암호화에 최적화된 방법 탐구
 - 이미지 파일 저장경로를 Database Server에 저장 (암호화시도) 

2019-10-29
- 사용자 별 저장공간 분할 및 경로 분할
- 사용자 식별 및 DB관리자 권한 등록 
 - 사용자별 DB에 경로저장방법 연구

2019-11-07
- 사용자 별 저장공간 분할 및 경로 분할 코드 완료
- 암호화 알고리즘 적용 연구
